#14500 테트로미노 - Python 3
#메모리 : 38320KB / 시간 : 5852ms
#2025년 3월 9일 02:36:49

n, m = map(int, input().split())
ma = [list(map(int, input().split())) for _ in range(n)]
r = 0

def bf(_x, _y) :
    global r
    tx = [[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
          [0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
          [0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 2, 1, 1, 1, 2, 2, 1, 1, 1],
          [0, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 3, 1, 1, 1]]
    ty = [[0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 1, 2],
          [1, 1, 1, 1, 1, 1, 2, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0],
          [2, 2, 2, 2, 1, 0, 0, 0, 1, 1, 0, 1, 1, 1, 0, 0, 1, 1, 1],
          [3, 0, 1, 2, 2, 1, 1, 0, 1, 0, 1, 1, 1, 0, 1, 0, 2, 2, 2]]
    for j in range(19) :
        s = 0
        mm = [[0 for _ in range(4)] for _ in range(4)]
        for i in range(4) :
            x = _x + tx[i][j]
            y = _y + ty[i][j]
            if x >= m or y >= n : continue
            s += ma[y][x]
        r = max(r, s)

for i in range(n) :
    for j in range(m) :
        bf(j, i)

print(r)